pabigot/FatFs/lpc17xx/LPC1700.h
#define	FIO1PIN		(*(volatile uint32_t*)0x2009C034)
#define	FIO1PINL	(*(volatile uint16_t*)0x2009C034)
#define	FIO1PINH	(*(volatile uint16_t*)0x2009C036)
#define	FIO1PIN0	(*(volatile uint8_t*)0x2009C034)
#define	FIO1PIN1	(*(volatile uint8_t*)0x2009C035)
#define	FIO1PIN2	(*(volatile uint8_t*)0x2009C036)
#define	FIO1PIN3	(*(volatile uint8_t*)0x2009C037)

#define	FIO2PIN		(*(volatile uint32_t*)0x2009C054)
#define	FIO2PINL	(*(volatile uint16_t*)0x2009C054)
#define	FIO2PINH	(*(volatile uint16_t*)0x2009C056)
#define	FIO2PIN0	(*(volatile uint8_t*)0x2009C054)
#define	FIO2PIN1	(*(volatile uint8_t*)0x2009C055)
#define	FIO2PIN2	(*(volatile uint8_t*)0x2009C056)
#define	FIO2PIN3	(*(volatile uint8_t*)0x2009C057)

#define	FIO3PIN		(*(volatile uint32_t*)0x2009C074)
#define	FIO3PINL	(*(volatile uint16_t*)0x2009C074)
#define	FIO3PINH	(*(volatile uint16_t*)0x2009C076)
#define	FIO3PIN0	(*(volatile uint8_t*)0x2009C074)
#define	FIO3PIN1	(*(volatile uint8_t*)0x2009C075)
#define	FIO3PIN2	(*(volatile uint8_t*)0x2009C076)
#define	FIO3PIN3	(*(volatile uint8_t*)0x2009C077)

#define	FIO4PIN		(*(volatile uint32_t*)0x2009C094)
#define	FIO4PINL	(*(volatile uint16_t*)0x2009C094)
#define	FIO4PINH	(*(volatile uint16_t*)0x2009C096)
#define	FIO4PIN0	(*(volatile uint8_t*)0x2009C094)
#define	FIO4PIN1	(*(volatile uint8_t*)0x2009C095)
#define	FIO4PIN2	(*(volatile uint8_t*)0x2009C096)
#define	FIO4PIN3	(*(volatile uint8_t*)0x2009C097)

#define	FIO0SET		(*(volatile uint32_t*)0x2009C018)
#define	FIO0SETL	(*(volatile uint16_t*)0x2009C018)
#define	FIO0SETH	(*(volatile uint16_t*)0x2009C01A)
#define	FIO0SET0	(*(volatile uint8_t*)0x2009C018)
#define	FIO0SET1	(*(volatile uint8_t*)0x2009C019)
#define	FIO0SET2	(*(volatile uint8_t*)0x2009C01A)
#define	FIO0SET3	(*(volatile uint8_t*)0x2009C01B)

#define	FIO1SET		(*(volatile uint32_t*)0x2009C038)
#define	FIO1SETL	(*(volatile uint16_t*)0x2009C038)
#define	FIO1SETH	(*(volatile uint16_t*)0x2009C03A)
#define	FIO1SET0	(*(volatile uint8_t*)0x2009C038)
#define	FIO1SET1	(*(volatile uint8_t*)0x2009C039)
#define	FIO1SET2	(*(volatile uint8_t*)0x2009C03A)
#define	FIO1SET3	(*(volatile uint8_t*)0x2009C03B)

#define	FIO2SET		(*(volatile uint32_t*)0x2009C058)
#define	FIO2SETL	(*(volatile uint16_t*)0x2009C058)
#define	FIO2SETH	(*(volatile uint16_t*)0x2009C05A)
#define	FIO2SET0	(*(volatile uint8_t*)0x2009C058)
#define	FIO2SET1	(*(volatile uint8_t*)0x2009C059)
#define	FIO2SET2	(*(volatile uint8_t*)0x2009C05A)
#define	FIO2SET3	(*(volatile uint8_t*)0x2009C05B)

#define	FIO3SET		(*(volatile uint32_t*)0x2009C078)
#define	FIO3SETL	(*(volatile uint16_t*)0x2009C078)
#define	FIO3SETH	(*(volatile uint16_t*)0x2009C07A)
#define	FIO3SET0	(*(volatile uint8_t*)0x2009C078)
#define	FIO3SET1	(*(volatile uint8_t*)0x2009C079)
#define	FIO3SET2	(*(volatile uint8_t*)0x2009C07A)
#define	FIO3SET3	(*(volatile uint8_t*)0x2009C07B)

#define	FIO4SET		(*(volatile uint32_t*)0x2009C098)
#define	FIO4SETL	(*(volatile uint16_t*)0x2009C098)
#define	FIO4SETH	(*(volatile uint16_t*)0x2009C09A)
#define	FIO4SET0	(*(volatile uint8_t*)0x2009C098)
#define	FIO4SET1	(*(volatile uint8_t*)0x2009C099)
#define	FIO4SET2	(*(volatile uint8_t*)0x2009C09A)
#define	FIO4SET3	(*(volatile uint8_t*)0x2009C09B)

#define	FIO0CLR		(*(volatile uint32_t*)0x2009C01C)
#define	FIO0CLRL	(*(volatile uint16_t*)0x2009C01C)
#define	FIO0CLRH	(*(volatile uint16_t*)0x2009C01E)
#define	FIO0CLR0	(*(volatile uint8_t*)0x2009C01C)
#define	FIO0CLR1	(*(volatile uint8_t*)0x2009C01D)
#define	FIO0CLR2	(*(volatile uint8_t*)0x2009C01E)
#define	FIO0CLR3	(*(volatile uint8_t*)0x2009C01F)

#define	FIO1CLR		(*(volatile uint32_t*)0x2009C03C)
#define	FIO1CLRL	(*(volatile uint16_t*)0x2009C03C)
#define	FIO1CLRH	(*(volatile uint16_t*)0x2009C03E)
#define	FIO1CLR0	(*(volatile uint8_t*)0x2009C03C)
#define	FIO1CLR1	(*(volatile uint8_t*)0x2009C03D)
#define	FIO1CLR2	(*(volatile uint8_t*)0x2009C03E)
#define	FIO1CLR3	(*(volatile uint8_t*)0x2009C03F)

#define	FIO2CLR		(*(volatile uint32_t*)0x2009C05C)
#define	FIO2CLRL	(*(volatile uint16_t*)0x2009C05C)
#define	FIO2CLRH	(*(volatile uint16_t*)0x2009C05E)
#define	FIO2CLR0	(*(volatile uint8_t*)0x2009C05C)
#define	FIO2CLR1	(*(volatile uint8_t*)0x2009C05D)
#define	FIO2CLR2	(*(volatile uint8_t*)0x2009C05E)
#define	FIO2CLR3	(*(volatile uint8_t*)0x2009C05F)

#define	FIO3CLR		(*(volatile uint32_t*)0x2009C07C)
#define	FIO3CLRL	(*(volatile uint16_t*)0x2009C07C)
#define	FIO3CLRH	(*(volatile uint16_t*)0x2009C07E)
#define	FIO3CLR0	(*(volatile uint8_t*)0x2009C07C)
#define	FIO3CLR1	(*(volatile uint8_t*)0x2009C07D)
#define	FIO3CLR2	(*(volatile uint8_t*)0x2009C07E)
#define	FIO3CLR3	(*(volatile uint8_t*)0x2009C07F)

#define	FIO4CLR		(*(volatile uint32_t*)0x2009C09C)
#define	FIO4CLRL	(*(volatile uint16_t*)0x2009C09C)
#define	FIO4CLRH	(*(volatile uint16_t*)0x2009C09E)
#define	FIO4CLR0	(*(volatile uint8_t*)0x2009C09C)
#define	FIO4CLR1	(*(volatile uint8_t*)0x2009C09D)
#define	FIO4CLR2	(*(volatile uint8_t*)0x2009C09E)
#define	FIO4CLR3	(*(volatile uint8_t*)0x2009C09F)

#define	IOIntStatus	(*(volatile uint32_t*)0x40028080)
#define	IO0IntStatR	(*(volatile uint32_t*)0x40028084)
#define	IO0IntStatF	(*(volatile uint32_t*)0x40028088)
#define	IO0IntClr	(*(volatile uint32_t*)0x4002808C)
#define	IO0IntEnR	(*(volatile uint32_t*)0x40028090)
#define	IO0IntEnF	(*(volatile uint32_t*)0x40028094)
#define	IO2IntStatR	(*(volatile uint32_t*)0x400280A4)
#define	IO2IntStatF	(*(volatile uint32_t*)0x400280A8)
#define	IO2IntClr	(*(volatile uint32_t*)0x400280AC)
#define	IO2IntEnR	(*(volatile uint32_t*)0x400280B0)
#define	IO2IntEnF	(*(volatile uint32_t*)0x400280B4)

/* Ethernet MAC */
#define	MAC1			(*(volatile uint32_t*)0x50000000)
#define	MAC2			(*(volatile uint32_t*)0x50000004)
#define	IPGT			(*(volatile uint32_t*)0x50000008)
#define	IPGR			(*(volatile uint32_t*)0x5000000C)
#define	CLRT			(*(volatile uint32_t*)0x50000010)
#define	MAXF			(*(volatile uint32_t*)0x50000014)
#define	SUPP			(*(volatile uint32_t*)0x50000018)
#define	TEST			(*(volatile uint32_t*)0x5000001C)
#define	MCFG			(*(volatile uint32_t*)0x50000020)
#define	MCMD			(*(volatile uint32_t*)0x50000024)
#define	MADR			(*(volatile uint32_t*)0x50000028)
#define	MWTD			(*(volatile uint32_t*)0x5000002C)
#define	MRDD			(*(volatile uint32_t*)0x50000030)
#define	MIND			(*(volatile uint32_t*)0x50000034)
#define	SA0				(*(volatile uint32_t*)0x50000040)
#define	SA1				(*(volatile uint32_t*)0x50000044)
#define	SA2				(*(volatile uint32_t*)0x50000048)
#define	Command			(*(volatile uint32_t*)0x50000100)
#define	Status			(*(volatile uint32_t*)0x50000104)
#define	RxDescriptor	(*(volatile uint32_t*)0x50000108)
#define	RxStatus		(*(volatile uint32_t*)0x5000010C)
#define	RxDescriptorNumber	(*(volatile uint32_t*)0x50000110)
#define	RxProduceIndex	(*(volatile uint32_t*)0x50000114)
#define	RxConsumeIndex	(*(volatile uint32_t*)0x50000118)
#define	TxDescriptor	(*(volatile uint32_t*)0x5000011C)
#define	TxStatus		(*(volatile uint32_t*)0x50000120)
#define	TxDescriptorNumber	(*(volatile uint32_t*)0x50000124)
#define	TxProduceIndex	(*(volatile uint32_t*)0x50000128)
#define	TxConsumeIndex	(*(volatile uint32_t*)0x5000012C)
#define	TSV0			(*(volatile uint32_t*)0x50000158)
#define	TSV1			(*(volatile uint32_t*)0x5000015C)
#define	RSV				(*(volatile uint32_t*)0x50000160)
#define	FlowControlCounter	(*(volatile uint32_t*)0x50000170)
#define	FlowControlStatus	(*(volatile uint32_t*)0x50000174)
#define	RxFliterCtrl		(*(volatile uint32_t*)0x50000200)
#define	RxFilterWoLStatus	(*(volatile uint32_t*)0x50000204)
#define	RxFilterWoLClear	(*(volatile uint32_t*)0x50000208)
#define	HashFilterL		(*(volatile uint32_t*)0x50000210)
#define	HashFilterH		(*(volatile uint32_t*)0x50000214)
#define	IntStatus		(*(volatile uint32_t*)0x50000FE0)
#define	IntEnable		(*(volatile uint32_t*)0x50000FE4)
#define	IntClear		(*(volatile uint32_t*)0x50000FE8)
#define	IntSet			(*(volatile uint32_t*)0x50000FEC)
#define	PowerDown		(*(volatile uint32_t*)0x50000FF4)

