pabigot/FatFs/lpc17xx/LPC1700.h
/* CAN1,CAN2 */
#define	AFMR		(*(volatile uint32_t*)0x4003C000)
#define	SFF_sa		(*(volatile uint32_t*)0x4003C004)
#define	SFF_GRP_sa	(*(volatile uint32_t*)0x4003C008)
#define	EFF_sa		(*(volatile uint32_t*)0x4003C00C)
#define	EFF_GRP_sa	(*(volatile uint32_t*)0x4003C010)
#define	ENDofTable	(*(volatile uint32_t*)0x4003C014)
#define	LUTerrAd	(*(volatile uint32_t*)0x4003C018)
#define	LUTerr		(*(volatile uint32_t*)0x4003C01C)

#define	CANTxSR		(*(volatile uint32_t*)0x40040000)
#define	CANRxSR		(*(volatile uint32_t*)0x40040004)
#define	CANMSR		(*(volatile uint32_t*)0x40040008)
#define	CAN1MOD		(*(volatile uint32_t*)0x40044000)
#define	CAN1CMR		(*(volatile uint32_t*)0x40044004)
#define	CAN1GSR		(*(volatile uint32_t*)0x40044008)
#define	CAN1ICR		(*(volatile uint32_t*)0x4004400C)
#define	CAN1IER		(*(volatile uint32_t*)0x40044010)
#define	CAN1BTR		(*(volatile uint32_t*)0x40044014)
#define	CAN1EWL		(*(volatile uint32_t*)0x40044018)
#define	CAN1SR		(*(volatile uint32_t*)0x4004401C)
#define	CAN1RFS		(*(volatile uint32_t*)0x40044020)
#define	CAN1RID		(*(volatile uint32_t*)0x40044024)
#define	CAN1RDA		(*(volatile uint32_t*)0x40044028)
#define	CAN1RDB		(*(volatile uint32_t*)0x4004402C)
#define	CAN1TFI1	(*(volatile uint32_t*)0x40044030)
#define	CAN1TID1	(*(volatile uint32_t*)0x40044034)
#define	CAN1TDA1	(*(volatile uint32_t*)0x40044038)
#define	CAN1TDB1	(*(volatile uint32_t*)0x4004403C)
#define	CAN1TFI2	(*(volatile uint32_t*)0x40044040)
#define	CAN1TID2	(*(volatile uint32_t*)0x40044044)
#define	CAN1TDA2	(*(volatile uint32_t*)0x40044048)
#define	CAN1TDB2	(*(volatile uint32_t*)0x4004404C)
#define	CAN1TFI3	(*(volatile uint32_t*)0x40044050)
#define	CAN1TID3	(*(volatile uint32_t*)0x40044054)
#define	CAN1TDA3	(*(volatile uint32_t*)0x40044058)
#define	CAN1TDB3	(*(volatile uint32_t*)0x4004405C)

#define	CAN2MOD		(*(volatile uint32_t*)0x40048000)
#define	CAN2CMR		(*(volatile uint32_t*)0x40048004)
#define	CAN2GSR		(*(volatile uint32_t*)0x40048008)
#define	CAN2ICR		(*(volatile uint32_t*)0x4004800C)
#define	CAN2IER		(*(volatile uint32_t*)0x40048010)
#define	CAN2BTR		(*(volatile uint32_t*)0x40048014)
#define	CAN2EWL		(*(volatile uint32_t*)0x40048018)
#define	CAN2SR		(*(volatile uint32_t*)0x4004801C)
#define	CAN2RFS		(*(volatile uint32_t*)0x40048020)
#define	CAN2RID		(*(volatile uint32_t*)0x40048024)
#define	CAN2RDA		(*(volatile uint32_t*)0x40048028)
#define	CAN2RDB		(*(volatile uint32_t*)0x4004802C)
#define	CAN2TFI1	(*(volatile uint32_t*)0x40048030)
#define	CAN2TID1	(*(volatile uint32_t*)0x40048034)
#define	CAN2TDA1	(*(volatile uint32_t*)0x40048038)
#define	CAN2TDB1	(*(volatile uint32_t*)0x4004803C)
#define	CAN2TFI2	(*(volatile uint32_t*)0x40048040)
#define	CAN2TID2	(*(volatile uint32_t*)0x40048044)
#define	CAN2TDA2	(*(volatile uint32_t*)0x40048048)
#define	CAN2TDB2	(*(volatile uint32_t*)0x4004804C)
#define	CAN2TFI3	(*(volatile uint32_t*)0x40048050)
#define	CAN2TID3	(*(volatile uint32_t*)0x40048054)
#define	CAN2TDA3	(*(volatile uint32_t*)0x40048058)
#define	CAN2TDB3	(*(volatile uint32_t*)0x4004805C)

/* SPI0 */
#define	S0SPCR		(*(volatile uint32_t*)0x40020000)
#define	S0SPSR		(*(volatile uint32_t*)0x40020004)
#define	S0SPDR		(*(volatile uint32_t*)0x40020008)
#define	S0SPCCR		(*(volatile uint32_t*)0x4002000C)
#define	S0SPINT		(*(volatile uint32_t*)0x4002001C)

/* SSP0,SSP1 */
#define	SSP0CR0		(*(volatile uint32_t*)0x40088000)
#define	SSP0CR1		(*(volatile uint32_t*)0x40088004)
#define	SSP0DR		(*(volatile uint32_t*)0x40088008)
#define	SSP0SR		(*(volatile uint32_t*)0x4008800C)
#define	SSP0CPSR	(*(volatile uint32_t*)0x40088010)
#define	SSP0IMSC	(*(volatile uint32_t*)0x40088014)
#define	SSP0RIS		(*(volatile uint32_t*)0x40088018)
#define	SSP0MIS		(*(volatile uint32_t*)0x4008801C)
#define	SSP0ICR		(*(volatile uint32_t*)0x40088020)
#define	SSP0DMACR	(*(volatile uint32_t*)0x40088024)
#define	SSP1CR0		(*(volatile uint32_t*)0x40030000)
#define	SSP1CR1		(*(volatile uint32_t*)0x40030004)
#define	SSP1DR		(*(volatile uint32_t*)0x40030008)
#define	SSP1SR		(*(volatile uint32_t*)0x4003000C)
#define	SSP1CPSR	(*(volatile uint32_t*)0x40030010)
#define	SSP1IMSC	(*(volatile uint32_t*)0x40030014)
#define	SSP1RIS		(*(volatile uint32_t*)0x40030018)
#define	SSP1MIS		(*(volatile uint32_t*)0x4003001C)
#define	SSP1ICR		(*(volatile uint32_t*)0x40030020)
#define	SSP1DMACR	(*(volatile uint32_t*)0x40030024)

/* I2C0,I2C1,I2C2 */
#define	I2C0CONSET		(*(volatile uint32_t*)0x4001C000)
#define	I2C0STAT		(*(volatile uint32_t*)0x4001C004)
#define	I2C0DAT			(*(volatile uint32_t*)0x4001C008)
#define	I2C0ADR0		(*(volatile uint32_t*)0x4001C00C)
#define	I2C0SCLH		(*(volatile uint32_t*)0x4001C010)
#define	I2C0SCLL		(*(volatile uint32_t*)0x4001C014)
#define	I2C0CONCLR		(*(volatile uint32_t*)0x4001C018)
#define	I2C0MMCTRL		(*(volatile uint32_t*)0x4001C01C)
#define	I2C0ADR1		(*(volatile uint32_t*)0x4001C020)
#define	I2C0ADR2		(*(volatile uint32_t*)0x4001C024)
#define	I2C0ADR3		(*(volatile uint32_t*)0x4001C028)
#define	I2C0DATA_BUFFER	(*(volatile uint32_t*)0x4001C02C)
#define	I2C0MASK		( (volatile uint32_t*)0x4001C030)
#define	I2C0MASK0		(*(volatile uint32_t*)0x4001C030)
#define	I2C0MASK1		(*(volatile uint32_t*)0x4001C034)
#define	I2C0MASK2		(*(volatile uint32_t*)0x4001C038)
#define	I2C0MASK3		(*(volatile uint32_t*)0x4001C03C)
#define	I2C1CONSET		(*(volatile uint32_t*)0x4005C000)
#define	I2C1STAT		(*(volatile uint32_t*)0x4005C004)
#define	I2C1DAT			(*(volatile uint32_t*)0x4005C008)
#define	I2C1ADR0		(*(volatile uint32_t*)0x4005C00C)
#define	I2C1SCLH		(*(volatile uint32_t*)0x4005C010)
#define	I2C1SCLL		(*(volatile uint32_t*)0x4005C014)
#define	I2C1CONCLR		(*(volatile uint32_t*)0x4005C018)
#define	I2C1MMCTRL		(*(volatile uint32_t*)0x4005C01C)
#define	I2C1ADR1		(*(volatile uint32_t*)0x4005C020)
#define	I2C1ADR2		(*(volatile uint32_t*)0x4005C024)
#define	I2C1ADR3		(*(volatile uint32_t*)0x4005C028)
#define	I2C1DATA_BUFFER	(*(volatile uint32_t*)0x4005C02C)
#define	I2C1MASK		( (volatile uint32_t*)0x4005C030)
#define	I2C1MASK0		(*(volatile uint32_t*)0x4005C030)
#define	I2C1MASK1		(*(volatile uint32_t*)0x4005C034)
#define	I2C1MASK2		(*(volatile uint32_t*)0x4005C038)
#define	I2C1MASK3		(*(volatile uint32_t*)0x4005C03C)
#define	I2C2CONSET		(*(volatile uint32_t*)0x400A0000)
#define	I2C2STAT		(*(volatile uint32_t*)0x400A0004)
#define	I2C2DAT			(*(volatile uint32_t*)0x400A0008)
#define	I2C2ADR0		(*(volatile uint32_t*)0x400A000C)
#define	I2C2SCLH		(*(volatile uint32_t*)0x400A0010)
#define	I2C2SCLL		(*(volatile uint32_t*)0x400A0014)
#define	I2C2CONCLR		(*(volatile uint32_t*)0x400A0018)
#define	I2C2MMCTRL		(*(volatile uint32_t*)0x400A001C)
#define	I2C2ADR1		(*(volatile uint32_t*)0x400A0020)
#define	I2C2ADR2		(*(volatile uint32_t*)0x400A0024)
#define	I2C2ADR3		(*(volatile uint32_t*)0x400A0028)
#define	I2C2DATA_BUFFER	(*(volatile uint32_t*)0x400A002C)
#define	I2C2MASK		( (volatile uint32_t*)0x400A0030)
#define	I2C2MASK0		(*(volatile uint32_t*)0x400A0030)
#define	I2C2MASK1		(*(volatile uint32_t*)0x400A0034)
#define	I2C2MASK2		(*(volatile uint32_t*)0x400A0038)
#define	I2C2MASK3		(*(volatile uint32_t*)0x400A003C)

/* I2S */
#define	I2SDAO		(*(volatile uint32_t*)0x400A8000)
#define	I2SDAI		(*(volatile uint32_t*)0x400A8004)
#define	I2STXFIFO	(*(volatile uint32_t*)0x400A8008)
#define	I2SRXFIFO	(*(volatile uint32_t*)0x400A800C)
#define	I2SSTATE	(*(volatile uint32_t*)0x400A8010)
#define	I2SDMA1		(*(volatile uint32_t*)0x400A8014)
#define	I2SDMA2		(*(volatile uint32_t*)0x400A8018)
#define	I2SIRQ		(*(volatile uint32_t*)0x400A801C)
#define	I2STXRATE	(*(volatile uint32_t*)0x400A8020)
#define	I2SRXRATE	(*(volatile uint32_t*)0x400A8024)
#define	I2STXBITRATE	(*(volatile uint32_t*)0x400A8028)
#define	I2SRXBITRATE	(*(volatile uint32_t*)0x400A802C)
#define	I2STXMODE	(*(volatile uint32_t*)0x400A8030)
#define	I2SRXMODE	(*(volatile uint32_t*)0x400A8034)

