pabigot/FatFs/lpc17xx/LPC1700.h
/* Timer0,Timer1,Timer2,Timer3 */
#define	T0IR		(*(volatile uint32_t*)0x40004000)
#define	T0TCR		(*(volatile uint32_t*)0x40004004)
#define	T0TC		(*(volatile uint32_t*)0x40004008)
#define	T0PR		(*(volatile uint32_t*)0x4000400C)
#define	T0PC		(*(volatile uint32_t*)0x40004010)
#define	T0MCR		(*(volatile uint32_t*)0x40004014)
#define	T0MR		( (volatile uint32_t*)0x40004018)
#define	T0MR0		(*(volatile uint32_t*)0x40004018)
#define	T0MR1		(*(volatile uint32_t*)0x4000401C)
#define	T0MR2		(*(volatile uint32_t*)0x40004020)
#define	T0MR3		(*(volatile uint32_t*)0x40004024)
#define	T0CCR		(*(volatile uint32_t*)0x40004028)
#define	T0CR0		(*(volatile uint32_t*)0x4000402C)
#define	T0CR1		(*(volatile uint32_t*)0x40004030)
#define	T0EMR		(*(volatile uint32_t*)0x4000403C)
#define	T0CTCR		(*(volatile uint32_t*)0x40004070)

#define	T1IR		(*(volatile uint32_t*)0x40008000)
#define	T1TCR		(*(volatile uint32_t*)0x40008004)
#define	T1TC		(*(volatile uint32_t*)0x40008008)
#define	T1PR		(*(volatile uint32_t*)0x4000800C)
#define	T1PC		(*(volatile uint32_t*)0x40008010)
#define	T1MCR		(*(volatile uint32_t*)0x40008014)
#define	T1MR		( (volatile uint32_t*)0x40008018)
#define	T1MR0		(*(volatile uint32_t*)0x40008018)
#define	T1MR1		(*(volatile uint32_t*)0x4000801C)
#define	T1MR2		(*(volatile uint32_t*)0x40008020)
#define	T1MR3		(*(volatile uint32_t*)0x40008024)
#define	T1CCR		(*(volatile uint32_t*)0x40008028)
#define	T1CR0		(*(volatile uint32_t*)0x4000802C)
#define	T1CR1		(*(volatile uint32_t*)0x40008030)
#define	T1EMR		(*(volatile uint32_t*)0x4000803C)
#define	T1CTCR		(*(volatile uint32_t*)0x40008070)

#define	T2IR		(*(volatile uint32_t*)0x40090000)
#define	T2TCR		(*(volatile uint32_t*)0x40090004)
#define	T2TC		(*(volatile uint32_t*)0x40090008)
#define	T2PR		(*(volatile uint32_t*)0x4009000C)
#define	T2PC		(*(volatile uint32_t*)0x40090010)
#define	T2MCR		(*(volatile uint32_t*)0x40090014)
#define	T2MR		( (volatile uint32_t*)0x40090018)
#define	T2MR0		(*(volatile uint32_t*)0x40090018)
#define	T2MR1		(*(volatile uint32_t*)0x4009001C)
#define	T2MR2		(*(volatile uint32_t*)0x40090020)
#define	T2MR3		(*(volatile uint32_t*)0x40090024)
#define	T2CCR		(*(volatile uint32_t*)0x40090028)
#define	T2CR0		(*(volatile uint32_t*)0x4009002C)
#define	T2CR1		(*(volatile uint32_t*)0x40090030)
#define	T2EMR		(*(volatile uint32_t*)0x4009003C)
#define	T2CTCR		(*(volatile uint32_t*)0x40090070)

#define	T3IR		(*(volatile uint32_t*)0x40094000)
#define	T3TCR		(*(volatile uint32_t*)0x40094004)
#define	T3TC		(*(volatile uint32_t*)0x40094008)
#define	T3PR		(*(volatile uint32_t*)0x4009400C)
#define	T3PC		(*(volatile uint32_t*)0x40094010)
#define	T3MCR		(*(volatile uint32_t*)0x40094014)
#define	T3MR		( (volatile uint32_t*)0x40094018)
#define	T3MR0		(*(volatile uint32_t*)0x40094018)
#define	T3MR1		(*(volatile uint32_t*)0x4009401C)
#define	T3MR2		(*(volatile uint32_t*)0x40094020)
#define	T3MR3		(*(volatile uint32_t*)0x40094024)
#define	T3CCR		(*(volatile uint32_t*)0x40094028)
#define	T3CR0		(*(volatile uint32_t*)0x4009402C)
#define	T3CR1		(*(volatile uint32_t*)0x40094030)
#define	T3EMR		(*(volatile uint32_t*)0x4009403C)
#define	T3CTCR		(*(volatile uint32_t*)0x40094070)

/* Repeative Interrupt Timer */
#define	RICOMPVAL	(*(volatile uint32_t*)0x400B0000)
#define	RIMASK		(*(volatile uint32_t*)0x400B0004)
#define	RICTRL		(*(volatile uint32_t*)0x400B0008)
#define	RICOUNTER	(*(volatile uint32_t*)0x400B000C)

/* PWM */
#define	PWM1IR		(*(volatile uint32_t*)0x40018000)
#define	PWM1TCR		(*(volatile uint32_t*)0x40018004)
#define	PWM1TC		(*(volatile uint32_t*)0x40018008)
#define	PWM1PR		(*(volatile uint32_t*)0x4001800C)
#define	PWM1PC		(*(volatile uint32_t*)0x40018010)
#define	PWM1MCR		(*(volatile uint32_t*)0x40018014)
#define	PWM1MR0		(*(volatile uint32_t*)0x40018018)
#define	PWM1MR1		(*(volatile uint32_t*)0x4001801C)
#define	PWM1MR2		(*(volatile uint32_t*)0x40018020)
#define	PWM1MR3		(*(volatile uint32_t*)0x40018024)
#define	PWM1CCR		(*(volatile uint32_t*)0x40018028)
#define	PWM1CR0		(*(volatile uint32_t*)0x4001802C)
#define	PWM1CR1		(*(volatile uint32_t*)0x40018030)
#define	PWM1CR2		(*(volatile uint32_t*)0x40018034)
#define	PWM1CR3		(*(volatile uint32_t*)0x40018038)
#define	PWM1MR4		(*(volatile uint32_t*)0x40018040)
#define	PWM1MR5		(*(volatile uint32_t*)0x40018044)
#define	PWM1MR6		(*(volatile uint32_t*)0x40018048)
#define	PWM1PCR		(*(volatile uint32_t*)0x4001804C)
#define	PWM1LER		(*(volatile uint32_t*)0x40018050)
#define	PWM1CTCR	(*(volatile uint32_t*)0x40018070)

/* Motor Control PWM */
#define	MCCON		(*(volatile uint32_t*)0x400B8000)
#define	MCCON_SET	(*(volatile uint32_t*)0x400B8004)
#define	MCCON_CLR	(*(volatile uint32_t*)0x400B8008)
#define	MCCAPCON	(*(volatile uint32_t*)0x400B800C)
#define	MCCAPCON_SET	(*(volatile uint32_t*)0x400B8010)
#define	MCCAPCON_CLR	(*(volatile uint32_t*)0x400B8014)
#define	MCTC		( (volatile uint32_t*)0x400B8018)
#define	MCTC0		(*(volatile uint32_t*)0x400B8018)
#define	MCTC1		(*(volatile uint32_t*)0x400B801C)
#define	MCTC2		(*(volatile uint32_t*)0x400B8020)
#define	MCLIM		( (volatile uint32_t*)0x400B8024)
#define	MCLIM0		(*(volatile uint32_t*)0x400B8024)
#define	MCLIM1		(*(volatile uint32_t*)0x400B8028)
#define	MCLIM2		(*(volatile uint32_t*)0x400B802C)
#define	MCMAT		( (volatile uint32_t*)0x400B8030)
#define	MCMAT0		(*(volatile uint32_t*)0x400B8030)
#define	MCMAT1		(*(volatile uint32_t*)0x400B8034)
#define	MCMAT2		(*(volatile uint32_t*)0x400B8038)
#define	MCDT		(*(volatile uint32_t*)0x400B803C)
#define	MCCP		(*(volatile uint32_t*)0x400B8040)
#define	MCCAP		( (volatile uint32_t*)0x400B8044)
#define	MCCAP0		(*(volatile uint32_t*)0x400B8044)
#define	MCCAP1		(*(volatile uint32_t*)0x400B8048)
#define	MCCAP2		(*(volatile uint32_t*)0x400B804C)
#define	MCINTEN		(*(volatile uint32_t*)0x400B8050)
#define	MCINTEN_SET	(*(volatile uint32_t*)0x400B8054)
#define	MCINTEN_CLR	(*(volatile uint32_t*)0x400B8058)
#define	MCCNTCON	(*(volatile uint32_t*)0x400B805C)
#define	MCCNTCON_SET	(*(volatile uint32_t*)0x400B8060)
#define	MCCNTCON_CLR	(*(volatile uint32_t*)0x400B8064)
#define	MCINTF		(*(volatile uint32_t*)0x400B8068)
#define	MCINTF_SET	(*(volatile uint32_t*)0x400B806C)
#define	MCINTF_CLR	(*(volatile uint32_t*)0x400B8070)
#define	MCCAP_CLR	(*(volatile uint32_t*)0x400B8074)

